In [1]:
# # Food Delivery Data Analysis Hackathon
# This notebook ontains the end-to end analysis of food delivery data, combining .csv, .json, and SQL sources.

import pandas as pd
import sqlite3
import json

In [16]:
# 1. Load Orders Data(.csv)
orders_df = pd.read_csv(r"C:\Users\Lenovo\Downloads\orders.csv")

In [17]:
# 2. Load Users Data (JSON)
users_df = pd.read_json(r"C:\Users\Lenovo\Downloads\users.json")

In [37]:
# 3. Load Restaurant Data (SQL)
conn = sqlite3.connect(r"C:\Users\Lenovo\Downloads\restaurants.db")
cursor = conn.cursor()

In [38]:
with open (r"C:\Users\Lenovo\Downloads\restaurants.sql","r", encoding="utf-8") as file: sql_script = file.read()

In [40]:
cursor.executescript(sql_script)
conn.commit()

In [41]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

          name
0  restaurants

In [42]:
df = pd.read_sql("SELECT * FROM restaurants", conn)
df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [43]:
# Join orders with users (Left Join on user_id)
merged_df = pd.merge(orders_df, users_df, on='user_id', how='left')

In [44]:
# Join with restaurants (Left Join on restaurant_id)
final_df = pd.merge(merged_df, restaurants_df, on='restaurant_id', how='left')

In [45]:
merged_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [46]:
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0